---
title: MassSurfaceData
classe: Autodesk.Revit.DB.Analysis.MassSurfaceData
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 18
---

# MassSurfaceData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Area { get; }` | `massSurfaceData.Area` | Double |
| `ElementId CategoryIdForConceptualSurfaceType { get; }` | `massSurfaceData.CategoryIdForConceptualSurfaceType` | ElementId |
| `ElementId ConceptualConstructionId { get; set; }` | `massSurfaceData.ConceptualConstructionId` | ElementId |
| `Boolean IsConceptualConstructionByEnergyData { get; set; }` | `massSurfaceData.IsConceptualConstructionByEnergyData` | Boolean |
| `Boolean IsGlazingShaded { get; set; }` | `massSurfaceData.IsGlazingShaded` | Boolean |
| `Boolean IsSlab { get; }` | `massSurfaceData.IsSlab` | Boolean |
| `Boolean IsUnderground { get; set; }` | `massSurfaceData.IsUnderground` | Boolean |
| `ElementId MassLevelDataId { get; }` | `massSurfaceData.MassLevelDataId` | ElementId |
| `ElementId MaterialId { get; set; }` | `massSurfaceData.MaterialId` | ElementId |
| `MassSurfaceDataMaterialType MaterialType { get; set; }` | `massSurfaceData.MaterialType` | MassSurfaceDataMaterialType |
| `Double PercentageGlazing { get; set; }` | `massSurfaceData.PercentageGlazing` | Double |
| `Double PercentageSkylights { get; set; }` | `massSurfaceData.PercentageSkylights` | Double |
| `ElementId ReferenceElementId { get; }` | `massSurfaceData.ReferenceElementId` | ElementId |
| `Double ShadeDepth { get; set; }` | `massSurfaceData.ShadeDepth` | Double |
| `Double SillHeight { get; set; }` | `massSurfaceData.SillHeight` | Double |
| `Double SkylightWidth { get; set; }` | `massSurfaceData.SkylightWidth` | Double |
| `MassSurfaceDataSource SurfaceDataSource { get; set; }` | `massSurfaceData.SurfaceDataSource` | MassSurfaceDataSource |
| `IList<Reference> GetFaceReferences()` | `massSurfaceData.GetFaceReferences()` | IList<Reference> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```